export const publicsArray = Array(25).fill(null);

export const userNames = ["Олена", "Артем", "Максим", "Ірина", "Дмитро", "Марія", "Олексій", "Софія", "Андрій", "Наталя"];

export const likeRange = {
    min: 15,
    max: 220
};

export const commentRange = {
    min: 1,
    max: 10
};

export const avatarRange = {
    min: 1,
    max: 6
};

export const userIdRange = {
    min: 100,
    max: 999
};

export const feedbackMessages = [
    "Все відмінно!",
    "Загалом все непогано. Але не всі.",
    "Коли ви робите фотографію, добре б прибирати палець із кадру. Зрештою, це просто непрофесійно.",
    "Моя бабуся випадково чхнула з фотоапаратом у руках і у неї вийшла фотографія краща.",
    "Я послизнувся на банановій шкірці і впустив фотоапарат на кота і у мене вийшла фотографія краще.",
    "Обличчя людей на фотці перекошені, ніби їх побивають. Як можна було зловити такий невдалий момент?",
    "Дуже цікава композиція, але є над чим працювати.",
    "Настрій на фотографії передається чудово, але освітлення залишає бажати кращого.",
    "Ця фотографія справила на мене враження, хоча я б рекомендував спробувати інший ракурс.",
    "Виглядає дуже весело, але, можливо, варто було б зменшити об'єкт на передньому плані.",
    "Оригінально, але я б порадив зосередитися на деталях.",
    "Трохи розмиття, але загалом хороша ідея!",
    "Вражаюче! Наступного разу спробуйте зловити момент без руху.",
    "Це справді цікаве зображення, але чому фон такий перевантажений?",
    "Фантастичний момент! Чекаю на нові роботи.",
    "Кольори на фотографії дуже яскраві, але може варто спробувати пастельні відтінки?",
    "Здається, ви добре вловили емоції, але перспектива могла бути кращою.",
    "Це фото точно привертає увагу, проте трохи відволікає фон.",
    "Чудова ідея, але я б рекомендував спробувати інші кути зйомки.",
    "Вам вдалося передати атмосферу, але, можливо, варто було б додати більше деталей.",
    "Дуже гарна фотографія! Можливо, варто зосередитися на меншій кількості об'єктів?",
    "Цей кадр виглядає живим, але я б порадив уникати занадто насичених кольорів.",
    "Гарний кадр, але я б хотів побачити більше контрасту.",
    "Це справді кумедна ситуація, але, можливо, варто було б відредагувати яскравість.",
    "Фантастичний момент! Чудово передано настрій.",
    "Не забувайте про правило третин, воно може допомогти зробити знімок ще кращим.",
    "Фотографія виглядає стильно, але спробуйте уникати надмірної обробки."
];

