export const publicsArray = Array(25).fill(null);

export const userNames = ["Олена", "Артем", "Максим", "Ірина", "Дмитро", "Марія", "Олексій", "Софія", "Андрій", "Наталія"];

export const likeRange = {
    min: 15,
    max: 220
};

export const commentRange = {
    min: 1,
    max: 10
};

export const avatarRange = {
    min: 1,
    max: 6
};

export const userIdRange = {
    min: 100,
    max: 999
};

export const randomWords = [
    'літо', 'зима', 'весна', 'осінь', 'дощ',
    'сонце', 'місяць', 'зірка', 'світ', 'космос',
    'книга', 'музика', 'любов', 'щастя', 'друзі',
    'пригоди', 'подорож', 'вдохнення', 'ідеї',
    'красота', 'сон', 'радість', 'свобода', 'час'
];

export const feedbackMessages = [
    "Все чудово!",
    "В цілому, це непогано. Але не для всіх.",
    "Коли ти фотографуєш, добре б прибрати палець з кадру. Адже це просто непрофесійно.",
    "Моя бабуся випадково чхнула, тримаючи камеру, і отримала кращу фотографію.",
    "Я послизнулася на банановій шкірці і впустила камеру на кішку, і отримала кращу фотографію.",
    "Обличчя людей на фотографії спотворені, ніби їх б'ють. Як можна було зафіксувати такий невдалий момент?",
    "Дуже цікава композиція, але є місце для вдосконалення.",
    "Настрій на фотографії передано чудово, але освітлення залишає бажати кращого.",
    "Ця фотографія справила на мене враження, хоча я б рекомендувала спробувати інший ракурс.",
    "Виглядає дуже весело, але, можливо, об'єкт на передньому плані слід зменшити.",
    "Оригінально, але я б порадила зосередитися на деталях.",
    "Трохи розмите, але в цілому хороша ідея!",
    "Вражаюче! Наступного разу намагайтеся зафіксувати момент без руху.",
    "Це дійсно цікаве зображення, але чому фон такий захаращений?",
    "Фантастичний момент! Чекаю нових робіт.",
    "Кольори на фотографії дуже яскраві, але, можливо, спробуйте пастельні відтінки?",
    "Здається, ви добре передали емоції, але перспектива могла б бути кращою.",
    "Ця фотографія однозначно привертає увагу, але фон трохи відволікає.",
    "Чудова ідея, але я б рекомендувала спробувати інші кути зйомки.",
    "Вам вдалося передати атмосферу, але, можливо, було б добре додати більше деталей.",
    "Дуже гарна фотографія! Можливо, зосередьтеся на меншій кількості об'єктів?",
    "Цей знімок виглядає жваво, але я б порадила уникати занадто насичених кольорів.",
    "Хороший знімок, але мені хотілося б бачити більше контрасту.",
    "Це дійсно кумедна ситуація, але, можливо, варто відрегулювати яскравість.",
    "Фантастичний момент! Настрій чудово передано.",
    "Не забувайте правило третин; це може допомогти зробити знімок ще кращим.",
    "Фотографія виглядає стильно, але намагайтеся уникати надмірного редагування."
];

